app/controllers/projects_controller.rb

  def create
       @project = Project.new(project_params)
       if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "project-4"], ["created_at", "2023-05-23 09:19:37.641149"], ["updated_at", "2023-05-23 09:19:37.641149"]]

  def update
    authorize @project
    #@project = Project.find(params[:id])
    @project.update(project_params)
---
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Project Nitesh2"], ["updated_at", "2023-05-23 11:52:49.565724"], ["id", 2]]

  def destroy
    #@project = Project.find(params[:id])
    @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 2]]

  def current_project
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]